{"submission_id": 18045758, "title": "Further Meta Poems to The Decadent Review for Consideration: So Light Plants Its Root, Remains on the Planetary Surface, & Remains on the Cloud Plaza", "filename": "files/submissions/18045758_2020-10-28_James_Grabill__Poems_to_The_Decadent_Review_for_Consideration_Oct_28_2020.docx", "history": [{"date": "2020-10-28T23:21:3", "message": "None"}, {"date": "2020-10-28T23:21:3", "message": "Hi James,<br /><br />Thank you for your interest in The Decadent Review. We have received your submission and look forward to reviewing it.<br/><br />Thanks!<br />-The Decadent Review"}, {"date": "2020-11-05T09:14:1", "message": "<p>Dear James,</p>\n<p>I've sent you an email to the address as it's registered at Submittable. Those sometimes end up in the junk folder, for whatever reason, so please check that, too.</p>\n<p>Thank you,</p>\n<p>D.</p>\n<p><br></p>"}, {"date": "2020-11-05T09:14:2", "message": "Dear James Grabill,<br /><br />Congratulations! This message confirms the acceptance of your submission to The Decadent Review.<br /><br />Thanks again. <br />Sincerely,<br />Dimitri Kaufman<br />The Decadent Review<br />"}, {"date": "2020-11-05T12:47:1", "message": "<p>Dear James,</p>\n<p>As I've written to you in an email (perhaps it's in the junk folder?):</p>\n<p>&gt;&gt; Thank you for the new submission. They’re fantastic.</p>\n<p>I particularly liked the \"So Light Plants Its Root” series, with the Rothko, Klee, Pollock, Graves refractions. It’s interesting both conceptually and&nbsp;corporeally, with the stanzas striking hard. It’s a pleasure to read.</p>\n<p>Here’s a private link to an online draft:&nbsp;<a href=\"https://thedecadentreview.com/corpus/so-light-plants-its-root/\" target=\"_blank\" class=\"link-color sbm-text link accessible-link\">https://thedecadentreview.com/corpus/so-light-plants-its-root/</a></p>\n<p>We’re trying to conform to the copyright restrictions, so I have a Klee’s “Hesitation\" as top art, with the others being a bit too strict for us (otherwise I would have probably included the other masters in the piece as it unfolds - alas we’ll have to settle for that Klee).</p>\n<p>Please let me know what you think.</p>\n<p>As for the other poems, we can slowly trickle those in in the next months.</p>"}, {"date": "2021-02-27T18:54:2", "message": ""}, {"date": "2021-02-27T18:54:4", "message": "None"}]}