{"submission_id": 20248869, "title": "\"His Leg Was Repatriated\" by Tomaž Šalamun translated by Matthew Moore", "filename": "files/submissions/20248869_2021-05-16_Matthew_Moore__One_Poem_from_Opera_Buffa_by_Tomaz_Salamun_translated_by_Matthew_Moore_-_The_Decadent_Review.docx", "history": [{"date": "2021-05-16T12:55:3", "message": "None"}, {"date": "2021-05-16T12:55:3", "message": "Hi Matthew,<br /><br />Thank you for your interest in The Decadent Review. We have received your submission and look forward to reviewing it.<br/><br />Thanks!<br />-The Decadent Review"}, {"date": "2021-05-16T13:11:0", "message": "<p>Dear Matthew,</p>\n<p>You caught me on a Sunday, having a rather despondent drink, reading submissions.</p>\n<p>I took the top of the queue, because I'm a bit fatigued, so why not.</p>\n<p>I want to publish the poem because of this line, specifically:</p>\n<p>\"... necks in crystallography. MacMillan!\"</p>\n<p>That \"MacMillan\", I mean, that's ridiculous. I actually giggled. Quite a feat, all considered.</p>\n<p>All right, we'll get in touch by email, as registered on Submittable (those sometimes end up in the junk folder, for whatever reason, so check that).</p>\n<p><br></p>\n<p>Thank you,</p>\n<p>D.</p>\n<p><br></p>\n<p><br></p>\n<p><br></p>"}, {"date": "2021-05-16T13:11:1", "message": "Dear Matthew Moore,<br /><br />Congratulations! This message confirms the acceptance of your submission to The Decadent Review.<br /><br />Thanks again. <br />Sincerely,<br />Dimitri Kaufman<br />The Decadent Review<br />"}, {"date": "2021-05-16T21:18:3", "message": "<p>Dear Dimitri Kaufman,</p>\n<p>Thank you so much for the acceptance and for your kind words.</p>\n<p>Very glad to have just learned this week of The Decadent Review, and the glittering vestments of its compositional geodes and civilization critiques. Glad, too, that \"crystallography. MacMillan!\" so struck you; I find it bafflingly wonderful; it's the part of the poem that showcases Šalamun's talent for locating poetic force at the crossroads of images and surnames, with and without the possible allusions.</p>\n<p>This Sunday has considerably brightened with this acceptance from The Decadent Review. Looking forward to the Shostakovich feature and all its irreverent reverence.&nbsp;</p>\n<p>Sincerely, with thanks and admiration,</p>\n<p>Matthew Moore</p>"}]}